Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་འདི་ལ་གནས་ན་
en: When bodhisattva great beings live by this teaching,

source: དེ་ལ་སྦྱོར་བའི་སྟོབས་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: they will swiftly attain the power of skillful application.

source: གཞན་ཡང་འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སྦྱངས་པའི་ཡོན་ཏན་གྱི་ཆོས་ཕྲ་མོ་སྤྱོད་ཀྱང་སེམས་ཅན་དག་ལ་སྙིང་རྗེ་ཆེན་པོའི་སེམས་དང་ལྡན་ནོ། །
en: Moreover, Lokadhara, even when bodhisattva great beings engage in a small aspect of ascetic practice, they will do so with great compassion for beings.

source: དེ་ལྟར་སྙིང་རྗེ་ཆེན་པོའི་སེམས་ལ་ཞུགས་པས་ཆོས་དེ་དག་གི་སྦྱོར་བ་ལ་ཤིན་ཏུ་བརྩོན་པར་འགྱུར་རོ། །
en: Immersed in such great compassion, they will exert themselves in the skillful application of these teachings.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་འདི་ལྟ་བུ་དག་ཐོབ་པར་འདོད་པ་དག་གཟུངས་ཀྱི་སྒོར་འཇུག་པ་ལ་ཤིན་ཏུ་བརྩོན་པར་བྱའོ། །
en: Moreover, Lokadhara, bodhisattva great beings who wish to attain such qualities must exert themselves in entering the dhāraṇī gateways.

source: དེ་ལ་གཟུངས་ཀྱི་སྒོར་འཇུག་པ་ལ་བརྩོན་པ་གང་ཞེ་ན།
en: What does it mean to make effort to enter the dhāraṇī gateways?

source: འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་རྐྱེན་ཚད་མེད་པ་ལ་རྟོག་པ་དང་། ཚད་མེད་པ་ཐམས་ཅད་ཀྱི་རྟོག་པ་ལ་སྦྱོར་བ་དང་ལྡན་པའི་སྦྱོར་བ་ཚད་མེད་པ་ལ་རྟོག་པའོ། །
en: It means contemplating the limitless conditions for all Dharma teachings, contemplating the limitless skillful applications of all Dharma teachings, and, moreover, contemplating the emergence of these limitless skillful applications.

source: དེ་ལྟར་བརྩོན་པའི་ཚེ་ཏིང་ངེ་འཛིན་གྱི་སྒོར་སྦྱོར་བས་ཆོས་ཐམས་ཅད་ཀྱི་སྒོ་ཚད་མེད་པའི་རྐྱེན་ལ་འཇུག་པ་དང་། ཚད་མེད་པའི་སྦྱོར་བ་དང་ལྡན་པའི་འཇུག་པ་དེ་ལྟ་བུའི་མཐུ་དང་ལྡན་པས་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པ་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། དྲན་པའི་མཐུ་དང་ལྡན་པ་དང་། ཆོས་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པའི་ཤེས་རབ་དང་ལྡན་པ་དང་། ལུས་འཕོས་ནས་ཀྱང་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་པ་དང་། ཆོས་ལ་ཕྱིར་མི་ལྡོག་པ་ནས་ནམ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: As they contemplate such, they will use their skillful application of gateways of absorption to enter limitless conditions for gateways into all Dharma teachings. With such power of entry, with its limitless skillful applications, they will gain knowledge of the true reality of all phenomena. They will be skilled in discerning the characteristics of all phenomena. They will possess the power of recollection. They will possess the insight that is skilled in discerning all phenomena. After leaving their bodies, they will obtain unbroken recollection. Having become irreversible from the Dharma, they will eventually attain unsurpassed and perfect awakening.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་གཟུངས་ཀྱི་སྒོར་ཞུགས་པས་ན་ཅི་དང་ཅིར་ལྡན་པ་དེའི་རྒྱུ་དང་རྐྱེན་གྱིས་ཆོས་ཐམས་ཅད་རྟོགས་ཏེ་
en: “Lokadhara, furthermore, through having entered the dhāraṇī gateways, bodhisattva great beings understand all phenomena in accordance with each of their causes and conditions.

source: རྒྱུ་དང་རྐྱེན་གཅིག་གིས་རྒྱུ་དང་རྐྱེན་སྟོང་ལ་འཇུག་ཅིང་ཤེས་རབ་ཀྱི་རྗེས་སུ་ཆོས་ཐམས་ཅད་ལ་སྦྱོར་བ་ཡང་ཐོབ་བོ། །
en: Through a single cause and condition, they understand thousands of causes and conditions, and attain access to all phenomena in accord with insight.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དེ་ལྟར་ཆོས་ལ་བརྩོན་འགྲུས་བསྐྱེད་པས་མཚན་ཉིད་གཅིག་པའི་སྒོའི་ཏིང་ངེ་འཛིན་ལ་འཇུག་པར་འགྱུར་རོ། །
en: Furthermore, Lokadhara, by generating such diligence in the practice of the Dharma, bodhisattva great beings will enter the absorption of the gateway of the single characteristic.

source: མཚན་ཉིད་གཅིག་པའི་སྒོའི་ཏིང་ངེ་འཛིན་ཐོབ་ནས་མཚན་ཉིད་ཚད་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་འཇུག་གོ། །
en: Once they attain the absorption of the gateway of the single characteristic, they will enter the absorption of limitless characteristics.

source: དེ་ལྟར་ཞུགས་ནས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྒྱུ་དང་རྐྱེན་དང་ཐབས་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་འཇུག་གོ། །
en: Once they have entered that, they will enter the gateway of all phenomena by means of various causes, conditions, and methods.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཐམས་ཅད་ཀྱི་སྒོར་ཞུགས་པས་ཆོས་ཐམས་ཅད་ལ་སྦྱོར་བ་ཐོབ་པར་གྱུར་ཏོ། །
en: In this manner, bodhisattvas attain access to all phenomena by entering the gateway of all phenomena.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་མང་དུ་བསྒོམས་པས་བསམ་གཏན་གྱི་མཚན་ཉིད་ལ་ཤིན་ཏུ་མཁས་པ་དང་། དམིགས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་ཤིན་ཏུ་མཁས་པར་འགྱུར་རོ། །
en: “Furthermore, Lokadhara, by intensively cultivating insight, bodhisattva great beings become skilled concerning the characteristics of concentration and skilled in the absorption free from observation.

source: དེ་ལྟར་ཏིང་ངེ་འཛིན་དེའི་ཤུགས་ཀྱིས་དམིགས་པ་ཚད་མེད་པ་དང་། ཏིང་ངེ་འཛིན་ལས་ལྡང་བ་ཚད་མེད་པ་ལ་མཁས་པར་འགྱུར་རོ། །
en: Through the force of such absorption, they will become skilled in limitless forms of observation and limitless ways of arising from absorption.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་འདི་ལ་གནས་ན་
en: If bodhisattvas abide in this,

source: ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་སྦྱོར་བ་ཐོབ་པར་འགྱུར་རོ། །
en: they will gain access to the true characteristics of all phenomena.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་རྟག་ཏུ་འཇིག་རྟེན་ལ་དམིགས་པའི་ཐབས་ལ་རྟོག་པ་དང་། འདུས་བྱས་ཀྱི་ཆོས་ལ་དམིགས་པ་ལ་རྟོག་པ་དང་། གཞན་ཡང་ཆོས་ཐམས་ཅད་ལ་དམིགས་པའི་ཐབས་རྣམ་པར་འཇིག་པ་ལ་བརྩོན་པའི་ནན་ཏན་བྱེད་དེ་དེ་ལ་ཆགས་པའི་གནས་ཀྱང་མེད་དོ། །
en: Furthermore, Lokadhara, while bodhisattva great beings always contemplate the means of observing the world and contemplate the observation of conditioned phenomena, they also exert themselves in destroying the means of observing all phenomena, and they are free from any attachment.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟར་ཆོས་དེ་ལ་བསྒོམས་པས་ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་སྦྱོར་བ་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: By cultivating this teaching, bodhisattvas will swiftly gain access to all phenomena.

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤིན་ཏུ་བརྩོན་འགྲུས་བསྐྱེད་དེ། སྦྱོར་བའི་སྟོབས་བསྐྱེད་ཀྱང་
en: Furthermore, Lokadhara, when bodhisattva great beings practice with tremendous diligence and generate the strength of practice,

source: ཆོས་ཐམས་ཅད་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་རྟོག་ཅིང་འཇིག་རྟེན་གྱི་བདེ་བ་ལ་མི་གནས། འཇིག་རྟེན་གྱི་ཆོས་དང་འདྲེས་པར་མི་སྤྱོད་དོ། །
en: they contemplate the true characteristic of all phenomena, do not dwell on worldly happiness, and do not get mixed up with worldly concerns.

source: དེ་ལྟ་བུའི་ཆོས་དང་ལྡན་པས་ན་མྱུར་དུ་ཆོས་རྣམས་ཀྱི་ཡང་དག་པའི་མཚན་ཉིད་ལ་མཁས་པར་འགྱུར་ཞིང་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རྣམ་པར་འབྱེད་པ་ལ་ཤིན་ཏུ་མཁས་པ་དང་། དྲན་པའི་མཐུ་ཐོབ་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རྣམ་གྲངས་འབྱེད་པ་ལ་མཁས་པའི་ཤེས་རབ་ཐོབ་པ་དང་། ལུས་འདི་འཕོས་ནས་ཀྱང་རྒྱུན་མི་འཆད་པའི་དྲན་པ་དང་ལྡན་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: With such a practice, one will swiftly become skilled concerning the true characteristics of phenomena, become skilled in discerning the characteristics of phenomena, gain the power of recollection, gain the insight that is skilled in discerning the categories of all phenomena, gain unbroken recollection after leaving one’s body, and attain unsurpassed and perfect awakening.

source: འཇིག་རྟེན་འཛིན་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཆོས་འདི་དག་གི་ཕ་རོལ་ཏུ་ཕྱིན་པར་འདོད་པ་དག་ཆོས་འདི་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་ཡོངས་སུ་བསྒོམ་པར་བྱའོ། །
en: Therefore, Lokadhara, bodhisattva great beings who wish to perfect these qualities must practice according to this teaching.

source: འཇིག་རྟེན་འཛིན་ཁྱོད་ཀྱིས་ཆོས་འདི་ལ་ཤིན་ཏུ་བརྩོན་པར་བསྒོམས་ན་རིང་པོར་མི་ཐོགས་པར་ཆོས་འདི་ལ་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་རོ། །
en: Lokadhara, if you diligently practice this teaching, before long you will attain unimpeded wisdom with regard to this teaching.

source: འཇིག་རྟེན་འཛིན་སྔོན་འདས་པའི་བསྐལ་པ་ཚད་མེད་དཔག་ཏུ་མེད་བསམ་གྱིས་མི་ཁྱབ་གྲངས་མེད་པ་འདས་པ་དེའི་དུས་ན། ཚད་མེད་ཡོན་ཏན་འོད་ཀྱི་རྒྱལ་པོ་ཞེས་བྱ་བ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མཁྱེན་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་རིག་པ། བླ་ན་མེད་པ་སྐྱེས་བུ་འདུལ་ཞིང་ཁ་ལོ་སྒྱུར་བ། ལྷ་དང་མིའི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་འཇིག་རྟེན་དུ་མངོན་པར་བྱུང་ངོ་། །
en: “Lokadhara, countless, limitless, fathomless immeasurable eons ago, a blessed buddha named Royal Light of Limitless Qualities appeared in the world. He was a thus-gone one, a worthy one, a perfect buddha, perfect in knowledge and conduct, a blissful one, a knower of the world, an unsurpassed being, a charioteer who guides beings, and a teacher of gods and humans.

source: བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོ་དེའི་ཚེའི་ཚད་ནི་བསྐལ་པ་གཅིག་གོ། །
en: The lifespan of the blessed one Royal Light of Limitless Qualities was one eon.

source: སངས་རྒྱས་དེའི་ཞིང་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲ་བས་བླ་རེར་བྲེས་སོ། །
en: His buddha realm was covered with a latticed canopy of the seven precious substances.

source: རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ཏ་ལ་རྣམས་ཀྱིས་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡོངས་སུ་བརྒྱན་ཏོ། །
en: This world was adorned with palm trees made of the seven precious substances, and

source: ཤིང་ཏ་ལ་དེ་དག་ལ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་དྲ་བས་སྟེང་བླ་རེས་བྲེས་ཏེ།
en: these palm trees themselves were adorned with latticed canopies of the seven precious substances.

source: ཤིང་དེ་དག་རེ་རེའི་འོག་ན་ཡང་སེང་གེའི་ཁྲི་རེ་རེ་སྟེ།
en: Below each palm tree was a lion throne.

source: ཤིང་ཏ་ལ་དེ་དག་ཀུན་ལས་ལྷའི་ན་བཟའ་རང་སྐྱེས་སོ། །
en: Divine fabrics magically appeared from each palm tree.

source: སེང་གེའི་ཁྲི་དེ་དག་ཀྱང་རིན་པོ་ཆེ་བཻདཱུརྱ་དང་། འཛམ་བུའི་ཆུ་ཀླུང་གི་གསེར་དང་། མུ་ཏིག་དམར་པོ་ལས་བྱས་པའོ། །
en: The lion thrones were fashioned of beryl, gold from the Jambū River, and red pearl.

source: ཤིང་ཏ་ལ་དེ་དག་གི་ཕྱོགས་བཞི་ན་བསུང་གི་ཤིང་དང་མེ་ཏོག་གི་ཤིང་གིས་བསྐོར་ཅིང་བརྒྱན་ཏོ། །
en: In each of the four directions surrounding the palm trees were fragrant and flowering trees.

source: ཤིང་དེ་དག་རེ་རེའི་འོག་ན་ཡང་རྫིང་བུ་རེ་རེ་སྟེ། ཡོན་ཏན་བརྒྱད་དང་ལྡན་པའི་ཆུས་ཡོངས་སུ་གང་ངོ་། །
en: Below each tree as well were small ponds filled with water of the eight qualities.

source: རྫིང་བུ་དེ་དག་ཀྱང་ཤེལ་དང་། ཨ་མྲ་གར་བ་དང་། མུ་ཏིག་དམར་པོ་ལས་བྱས་པ། ཆུ་དེ་དག་གི་སྟེང་ན་པད་མོ་སྔོན་པོ་དང་། དམར་པོ་དང་། དཀར་པོ་དང་། ལེ་བརྒན་གྱིས་སྟེང་ཡོངས་སུ་ཁེབས་ཏེ
en: The ponds were made of crystal, emerald, and red pearl. The surfaces of the ponds were covered with blue, red, white, and pink lotus flowers.

source: རྫིང་དེ་རྣམས་ཀྱི་འགྲམ་ཡང་རིན་པོ་ཆེ་སྣ་བདུན་ལས་བྱས་སོ། །
en: The banks of the ponds were made of the seven precious substances.

source: འཇིག་རྟེན་འཛིན་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་དེ་ལྟར་རིན་པོ་ཆེ་མང་པོས་ཡོངས་སུ་བརྒྱན་ཏེ།
en: “Lokadhara, this buddha realm was adorned with many precious substances.

source: འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཕྱོགས་བཞི་ན་གཞན་ཡང་སུམ་ཅུ་རྩ་གསུམ་གནམ་གྱི་ལྷ་རྫས་ཀྱི་ཤིང་པ་རི་ཛཱ་ཏ་ཀ་དང་། ཀོ་བི་དཱ་ར་སྟོང་ཕྲག་དུ་མས་འཇིག་རྟེན་གྱི་ཁམས་དེའི་མཐའ་ཡོངས་སུ་བསྐོར་ཏོ། །
en: In the periphery, in the four directions of this world, were many thousands of trees found in the Heaven of the Thirty-Three, such as pārijāta and kovidāra trees.

source: རིན་པོ་ཆེའི་ཤིང་དེ་དག་གི་འོད་ཟེར་གྱིས་ཉི་མ་དང་། ཟླ་བ་དང་། སྐར་མའི་འོད་ཐམས་ཅད་མི་སྣང་བར་ཟིལ་གྱིས་མནན་ཏོ། །
en: The light shining from these trees outshone the light of the sun, moon, and stars.

source: འཇིག་རྟེན་འཛིན་འཇིག་རྟེན་གྱི་ཁམས་དེའི་ཤིང་ཏ་ལ་དང་། རིན་པོ་ཆེའི་དྲ་བ་ཀུན་ནས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྒྲ་དབྱངས་དམ་པ་ཇི་ལྟར་ལྷ་རྣམས་ཀྱི་གླུ་དང་བསྟོད་པའི་དབྱངས་ལྟ་བུ་རང་འབྱུང་སྟེ
en: Lokadhara, in this world various sublime melodies sprang from the palm trees and their jeweled lattices, and it sounded just like the melodious song and praises of the gods.

source: རྟག་ཏུ་འདི་ལྟ་བུའི་དབྱངས་ཤིན་ཏུ་སྙན་པ་གྲག་གི །
en: The music was always extremely pleasing.

source: ངན་སོང་གསུམ་མེད་དེ་ངན་སོང་གསུམ་གྱི་མིང་ཙམ་ཡང་མི་གྲག་གོ །
en: There were no three lower realms here; even the name three lower realms was unheard of.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོས་སེམས་ཅན་རྣམས་ལ་ཆོས་འདི་དག་རྒྱས་པར་གསུངས་སོ། །
en: “Lokadhara, the blessed Royal Light of Limitless Qualities taught the following Dharma in full to the beings there.

source: འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྡེ་སྣོད་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅོད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཤིན་ཏུ་དགའ་བར་བྱེད་པ་ཞེས་བྱ་བ་སྟོན་ཏོ། །
en: He taught the perfection of insight and the Bodhisattva Collection called Countering the Doubts and Pleasing the Minds of All Beings .

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོ་ཆོས་སྟོན་པའི་ཚེ། ཉིན་ཞག་གཅིག་ལའང་སེམས་ཅན་ཚད་མེད་པ་ཁྲི་ཕྲག་བརྒྱ་སྟོང་སྙེད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: Lokadhara, when the blessed Royal Light of Limitless Qualities taught the Dharma, within a single day, hundreds of thousands of beings would develop the mind directed toward unsurpassed and perfect awakening.

source: སེམས་བསྐྱེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །
en: All of them also completed the accumulations that lead to awakening.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོས་དེ་ལྟར་སེམས་ཅན་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། །
en: Lokadhara, in this manner, the blessed Royal Light of Limitless Qualities ripened countlessly many innumerable beings to unsurpassed and perfect awakening.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤིན་ཏུ་མང་ངོ་། །
en: The bodhisattva great beings in this buddha realm were in great number.

source: འཇིག་རྟེན་འཛིན་བཅོམ་ལྡན་འདས་དེ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དམ་པའི་ཆོས་བསྐལ་པ་ཕྱེད་ཀྱི་བར་དུ་གནས་པར་གྱུར་ཏོ། །
en: Lokadhara, after that Blessed One entered parinirvāṇa, the sublime Dharma remained for half an eon.

source: བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་
en: Then, since the blessed Royal Light of Limitless Qualities had entered parinirvāṇa,

source: དམ་པའི་ཆོས་རྣམ་པར་འཇིག་ཏུ་ཉེ་བ་ན་འོག་མའི་ཕྱོགས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུ་འདས་པའི་ཕ་རོལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་བློ་གྲོས་ཞེས་བྱ་བ་ཞིག་དེ་ནས་ཚེ་འཕོས་ཏེ་ཞིང་འདིར་སྐྱེས་ནས་ལོ་བཅུ་དྲུག་ལོན་པ་དང་རབ་ཏུ་བྱུང་སྟེ
en: the sublime Dharma came close to disappearing. At that time there was a bodhisattva named Limitless Intelligence, who lived in a buddha realm located below, past ten buddha realms. When his life there ended, he was born in this buddha realm, where he received ordination at the age of sixteen.

source: བཅོམ་ལྡན་འདས་ཚད་མེད་འོད་ཀྱི་ཡོན་ཏན་རྒྱལ་པོའི་ཆོས་རྣམ་པར་འཇིག་ཏུ་ཉེ་བ་ན་
en: When the Dharma of the blessed Royal Light of Limitless Qualities had come close to disappearing,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་གྲོལ་བར་འགྱུར་བ་ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ལ་སྦྱོར་བའི་མདོ་ཐོས་པར་གྱུར་ཏོ། །
en: he heard the discourse that applies the liberation of the bodhisattva great beings to the aggregates, elements, and sense sources.

source: བྱང་ཆུབ་སེམས་དཔའ་ཚད་མེད་བློ་གྲོས་ཀྱིས་མདོ་སྡེ་འདི་ཐོས་ནས་བརྩོན་འགྲུས་ཆེན་པོ་བསྐྱེད་དེ། ཆོས་འདི་དག་གི་མཐར་ཡང་ཕྱིན་ཅིང་། སྦྱོར་བའི་མཐུ་ཤིན་ཏུ་ཟབ་མོ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: The bodhisattva Limitless Intelligence heard this discourse and generated great diligence, perfected the related qualities, and gained the profound power of mastery.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དགེ་བའི་རྩ་བ་དེ་ཉིད་ཀྱི་རྒྱུ་དང་རྐྱེན་གྱིས་དེ་ནས་ཚེ་འཕོས་ནས།
en: Through the causes and conditions of his roots of virtue, after this bodhisattva left that life,

source: སངས་རྒྱས་ཁྲི་ཕྲག་ཉི་ཤུ་དང་ཕྲད་དེ་ཆོས་འདི་དག་དང་ལྡན་པར་གྱུར་ཏོ། །
en: he encountered two hundred thousand buddhas and received their teachings.

source: སྔོན་གྱི་གནས་ཀྱང་རྟག་ཏུ་དྲན་པས་གཞོན་ནུ་ནས་རབ་ཏུ་བྱུང་སྟེ།
en: Since he continuously recalled his past lives, he received ordination at an early age.

source: ཚངས་པར་སྤྱད་པ་སྤྱོད་ཅིང་རྟག་ཏུ་དྲན་པའི་མཐུ་དང་ལྡན་པར་གྱུར་ཏོ། །
en: He practiced pure conduct and always had the power of remembrance.

source: གང་ནས་གང་དུ་སྐྱེས་པའི་གནས་ཀུན་ཏུ་ཆོས་འདི་ལྟ་བུ་དང་མ་བྲལ་ཏེ།
en: No matter where he was born, he never lost this Dharma.

source: སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་དྲན་པ་རྒྱུན་མི་འཆད་པ་དང་ལྡན་ཏེ།
en: In all his lives, his remembrance was unbroken.

source: དེ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ནས་མཚན་ཡང་ཚད་མེད་འོད་ཀྱི་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱའོ། །
en: Once he fully awakened to unsurpassed and perfect buddhahood, his name was Royal Array of Boundless Light.

source: འཇིག་རྟེན་འཛིན་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཡོངས་སུ་རྫོགས་པར་འདོད་པ་དག་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལྔ་བརྒྱའི་ཐ་མ་ལ་ཤིན་ཏུ་བརྩོན་འགྲུས་རྩོམ་ཞིང་ཡི་དམ་ཆེན་པོ་བསྐྱེད་ནས་
en: Lokadhara, therefore bodhisattva great beings who wish to fully awaken to unsurpassed and perfect buddhahood, and who seek to perfect omniscient wisdom rapidly, must, during the final period of five hundred years after I have entered parinirvāṇa, be diligent and generate a strong resolve.

source: མོས་པ་ཆེན་པོ་དང་། བརྩོན་འགྲུས་ཆེན་པོ་དང་། བག་བྱེད་པ་ཆེན་པོ་བསྐྱེད་དེཕྱི་མའི་དུས་ངན་པར་གྱུར་པ་དེའི་ཚེ་མདོ་སྡེ་འདི་དག་ལ་སོགས་པ་ཤིན་ཏུ་བསྲུང་ཞིང་བསྐྱབ་པར་བྱའོ། །
en: Then they must generate great interest, great diligence, and great carefulness, so that in that dire latter age they will protect and sustain this discourse and others.”

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་བཟང་སྐྱོང་ལ་སོགས་པ་འདུག་པ་སྟན་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At that moment the bodhisattva Bhadrapāla rose from his seat, and with his palms pressed together in the direction of the Blessed One said,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་ཀྱང་ཕྱི་མ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་དམ་པའི་ཆོས་རྣམ་པར་འཇིག་ཏུ་ཉེ་བ་ན།
en: “Blessed One, when the sublime Dharma comes close to disappearing during the final five-hundred-year period to come,

source: བདག་ཅག་གིས་མདོ་སྡེ་འདི་དག་ལ་སོགས་པ་བསྲུང་ཞིང་བསྐྱབ་པའི་ཕྱིར་བརྩོན་འགྲུས་ཤིན་ཏུ་བསྐྱེད་དེ་ཀློག་པ་དང་། འདོན་པ་དང་། ཉན་པ་དང་། འཛིན་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་བསྟན་པར་འཚལ་ལོ། །
en: we shall generate tremendous diligence and read, recite, listen, retain, and teach in full this discourse and others, in order to protect and sustain them.”

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་དུ་མ་སྙེད་འདུག་པ་ལས་ལངས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས། མིག་མི་འཛུམས་པར་བལྟ་ཞིང་འདི་སྐད་དུ་ཡི་དམ་དུ་བཅས་སོ། །
en: Additionally, thousands of bodhisattvas rose from their seats, and with palms pressed together in the direction of the Blessed One, gazed upon him with unblinking eyes and promised,

source: བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཕྱི་མ་མ་འོངས་པའི་དུས་ལྔ་བརྒྱའི་ཐ་མ་ལ་འདི་ལྟ་བུའི་ཤིན་ཏུ་ཟབ་མོ་ཆགས་པ་མེད་པའི་མདོ་སྡེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྣང་བ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དགེ་བའི་ཡོན་ཏན་སྐྱེ་བར་འགྱུར་བ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་བདག་ཅག་གིས་ཤིན་ཏུ་བསྲུང་ཞིང་འཛིན་པར་འཚལ་ལ།
en: “Blessed One, in the final five-hundred-year period to come, we will sustain and uphold this discourse, which is profound and free from attachment, which is the light of all the buddhas, which arouses the virtuous qualities of the bodhisattvas, and which perfects the accumulations of awakening of all bodhisattvas.

source: ཆོས་འདི་ཐོས་ནས་རྣམ་པར་དག་ཅིང་སེམས་རབ་ཏུ་དག་པར་གྱུར་ཏེ་
en: Having heard this teaching, we are purified—our minds are purified.

source: ཚོལ་བ་དང་། འཆང་བ་དང་། འཛིན་པ་དང་། འདོན་པ་དང་། ཀློག་པ་ལ་ཤིན་ཏུ་བརྩོན་པར་བགྱིའོ། །
en: We will exert ourselves in seeking, bearing, retaining, reciting, and reading it.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་བཞད་མོ་འཛུམ་པ་མཛད་པ་དང་། དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་གྱིས་ཀུན་ཏུ་སྣང་བར་གྱུར་ཏེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: The Blessed One then smiled, and the worlds of the great trichiliocosm were filled with light, and all the worlds shook six times.

source: དེའི་ཚེ་ན་དགའ་བོ་འདུག་པ་ལས་ལངས་ནས་བླ་གོས་ཕྱོགས་གཅིག་ཏུ་བྱས་ཏེ་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས་
en: Then Ānanda rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: With his palms together, he bowed toward the Blessed One and asked,

source: བཅོམ་ལྡན་འདས་ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་ན་དེང་འདིར་བཞད་མོ་འཛུམ་པ་མཛད་དེ་ས་ཆེན་པོ་ཡང་རབ་ཏུ་གཡོས་པར་གྱུར།
en: “Due to what cause and condition did you smile today such that the earth shook?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One answered,

source: ཁྱོད་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་རྣམས་ཡི་དམ་ཆེན་པོ་བཅས་ནས། ཕྱི་མ་མ་འོངས་པའི་དུས་སུ་ཤིན་ཏུ་ཟབ་མོའི་མདོ་སྡེ་ཆགས་པ་མེད་པའི་ཆོས་འདི་ལྟ་བུ་ཤིན་ཏུ་བསྲུང་ཞིང་འཛིན་པར་ཡི་དམ་བཅས་པ་མཐོང་ངམ།
en: “Did you see these bodhisattva great beings pledge, with great resolve, to sustain and uphold this profound discourse, the Dharma of nonattachment, in the future?

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ནི་སྐྱེ་བ་འདི་གཅིག་པུར་ཡི་དམ་འདི་ལྟ་བུར་བཅའ་བ་མ་ཡིན་གྱི།
en: Ānanda, these bodhisattvas have not only made this pledge in this one life.

source: དགའ་བོ་ངས་མངོན་པར་དྲན་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་སུ་ཡང་ཡི་དམ་འདི་ལྟ་བུ་བཅས་ཏེ་དུས་གསུམ་དུ་སངས་རྒྱས་དེ་དག་གི་ཆོས་ཀྱང་ཤིན་ཏུ་བསྲུངས་ཏེ།
en: Ānanda, I recall that these bodhisattvas have previously pledged, in countless, innumerable buddha realms, to sustain the teachings of those buddhas throughout the three times. Thereby,

source: སེམས་ཅན་ཚད་མེད་དཔག་ཏུ་མེད་པ་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་དོན་བྱས་སོ། །
en: they have served the purpose of benefitting and bringing happiness to countless, innumerable beings.

source: དེ་ཡང་དུས་གསུམ་དུ་ངའི་ཆོས་ཀྱང་སྐྱོབ་ཅིང་བསྲུང་བར་འགྱུར་ཏེ།
en: They will also protect and sustain my teachings throughout the three times.

source: ད་ལྟར་གྱི་དུས་དང་ང་མྱ་ངན་ལས་འདས་པའི་འོག་ཆོས་རྣམ་པར་འཇིག་ཏུ་ཉེ་བ་ན་སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་དོན་བྱེད་པར་འགྱུར་རོ། །
en: At present, and when the Dharma is waning after I have entered parinirvāṇa, they will serve the purpose of benefitting and bringing happiness to innumerable beings.

source: འཇིག་རྟེན་འཛིན་བཟང་སྐྱོང་ལ་སོགས་པ་དུས་གསུམ་དུ་ངའི་ཆོས་བསྲུང་བར་མ་ཟད་ཀྱི་
en: Ānanda, Bhadrapāla and the others will not only sustain my teachings throughout the three times—

source: བསྐལ་པ་བཟང་པོའི་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱང་དུས་གསུམ་དུ་བསྲུང་ཞིང་འཛིན་པར་འགྱུར་རོ། །
en: they will also sustain and uphold the teachings of all the buddhas of this Fortunate Eon.

source: དེ་བཞིན་དུ་མ་འོངས་པའི་དུས་ཀྱི་སངས་རྒྱས་ཀྱི་ཆོས་འདི་ལྟ་བུ་དག་ཀྱང་བསྲུང་ཞིང་འཛིན་པར་འགྱུར་རོ། །
en: Likewise, they will sustain and uphold similar teachings of the buddhas of the future.

source: དགའ་བོ་ངས་སྐྱེས་བུ་དེ་དག་གི་ཡོན་ཏན་ཚད་མེད་པ་ལྷུན་གྱིས་གྲུབ་པ་དང་། སེམས་ཅན་ཚད་མེད་པ་རྣམས་ལ་ཕན་པ་དང་བདེ་བའི་དོན་བྱས་པ་བཤད་ན་བརྗོད་ཀྱིས་མི་རྫོགས་སོ། །
en: Ānanda, if I attempted to describe the effortlessly accomplished virtues of such bodhisattvas and the purposes they have served in benefitting and bringing happiness to innumerable beings, my explanations would never end.

source: དགའ་བོ་ངས་སྐྱེས་བུ་དེ་དག་གི་ཡོན་ཏན་ཀུན་བཤད་ན་སྐྱེ་བོ་དག་ཡིད་ཆེས་པར་མི་འགྱུར་རོ། །
en: Ānanda, if I described the qualities of these bodhisattvas, beings would not believe it.

source: གལ་ཏེ་སྐྱེ་བོ་དག་སངས་རྒྱས་ཀྱི་གསུང་ལ་ཡིད་ཆེས་པར་མ་གྱུར་ན་
en: If beings do not trust the Buddha’s speech,

source: ཡུན་རིང་པོར་བདེ་བ་སྟོར་ནས་སྡུག་བསྔལ་མང་པོ་མྱོང་ཞིང་ངན་སོང་དུ་ལྟུང་བར་འགྱུར་རོ། །
en: they will toss aside their long-term well-being and fall into the lower realms to suffer greatly.

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སྔོན་གྱི་སྨོན་ལམ་ལ་གནས་པ་ནི་མ་གཏོགས་ཏེ། སེམས་ཅན་ལ་ཕན་པ་དང་། བདེ་བའི་དོན་བྱས་པ་ཕྱོགས་གཅིག་ཅིག་བཤད་པར་བྱའོ། །
en: Ānanda, I shall now describe a mere fraction of the purposes these bodhisattvas have served in benefitting others and bringing them happiness, aside from the fact that they have adhered to their previous aspirations.
